benchmark/results/baseline-k6.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /scripts/load.js
        output: -

     scenarios: (100.00%) 1 scenario, 20 max VUs, 1m30s max duration (incl. graceful stop):
              * steady: 20 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 20/20 VUs, 81 complete and 0 interrupted iterations
steady   [   2% ] 20 VUs  0m01.0s/1m0s

running (0m02.0s), 20/20 VUs, 181 complete and 0 interrupted iterations
steady   [   3% ] 20 VUs  0m02.0s/1m0s

running (0m03.0s), 20/20 VUs, 283 complete and 0 interrupted iterations
steady   [   5% ] 20 VUs  0m03.0s/1m0s

running (0m04.0s), 20/20 VUs, 378 complete and 0 interrupted iterations
steady   [   7% ] 20 VUs  0m04.0s/1m0s

running (0m05.0s), 20/20 VUs, 473 complete and 0 interrupted iterations
steady   [   8% ] 20 VUs  0m05.0s/1m0s

running (0m06.0s), 20/20 VUs, 590 complete and 0 interrupted iterations
steady   [  10% ] 20 VUs  0m06.0s/1m0s

running (0m07.0s), 20/20 VUs, 688 complete and 0 interrupted iterations
steady   [  12% ] 20 VUs  0m07.0s/1m0s

running (0m08.0s), 20/20 VUs, 782 complete and 0 interrupted iterations
steady   [  13% ] 20 VUs  0m08.0s/1m0s

running (0m09.0s), 20/20 VUs, 882 complete and 0 interrupted iterations
steady   [  15% ] 20 VUs  0m09.0s/1m0s

running (0m10.0s), 20/20 VUs, 984 complete and 0 interrupted iterations
steady   [  17% ] 20 VUs  0m10.0s/1m0s

running (0m11.0s), 20/20 VUs, 1096 complete and 0 interrupted iterations
steady   [  18% ] 20 VUs  0m11.0s/1m0s

running (0m12.0s), 20/20 VUs, 1190 complete and 0 interrupted iterations
steady   [  20% ] 20 VUs  0m12.0s/1m0s

running (0m13.0s), 20/20 VUs, 1296 complete and 0 interrupted iterations
steady   [  22% ] 20 VUs  0m13.0s/1m0s

running (0m14.0s), 20/20 VUs, 1387 complete and 0 interrupted iterations
steady   [  23% ] 20 VUs  0m14.0s/1m0s

running (0m15.0s), 20/20 VUs, 1493 complete and 0 interrupted iterations
steady   [  25% ] 20 VUs  0m15.0s/1m0s

running (0m16.0s), 20/20 VUs, 1592 complete and 0 interrupted iterations
steady   [  27% ] 20 VUs  0m16.0s/1m0s

running (0m17.0s), 20/20 VUs, 1692 complete and 0 interrupted iterations
steady   [  28% ] 20 VUs  0m17.0s/1m0s

running (0m18.0s), 20/20 VUs, 1793 complete and 0 interrupted iterations
steady   [  30% ] 20 VUs  0m18.0s/1m0s

running (0m19.0s), 20/20 VUs, 1891 complete and 0 interrupted iterations
steady   [  32% ] 20 VUs  0m19.0s/1m0s

running (0m20.0s), 20/20 VUs, 1987 complete and 0 interrupted iterations
steady   [  33% ] 20 VUs  0m20.0s/1m0s

running (0m21.0s), 20/20 VUs, 2083 complete and 0 interrupted iterations
steady   [  35% ] 20 VUs  0m21.0s/1m0s

running (0m22.0s), 20/20 VUs, 2181 complete and 0 interrupted iterations
steady   [  37% ] 20 VUs  0m22.0s/1m0s

running (0m23.0s), 20/20 VUs, 2283 complete and 0 interrupted iterations
steady   [  38% ] 20 VUs  0m23.0s/1m0s

running (0m24.0s), 20/20 VUs, 2380 complete and 0 interrupted iterations
steady   [  40% ] 20 VUs  0m24.0s/1m0s

running (0m25.0s), 20/20 VUs, 2488 complete and 0 interrupted iterations
steady   [  42% ] 20 VUs  0m25.0s/1m0s

running (0m26.0s), 20/20 VUs, 2577 complete and 0 interrupted iterations
steady   [  43% ] 20 VUs  0m26.0s/1m0s

running (0m27.0s), 20/20 VUs, 2675 complete and 0 interrupted iterations
steady   [  45% ] 20 VUs  0m27.0s/1m0s

running (0m28.0s), 20/20 VUs, 2769 complete and 0 interrupted iterations
steady   [  47% ] 20 VUs  0m28.0s/1m0s

running (0m29.0s), 20/20 VUs, 2866 complete and 0 interrupted iterations
steady   [  48% ] 20 VUs  0m29.0s/1m0s

running (0m30.0s), 20/20 VUs, 2965 complete and 0 interrupted iterations
steady   [  50% ] 20 VUs  0m30.0s/1m0s

running (0m31.0s), 20/20 VUs, 3061 complete and 0 interrupted iterations
steady   [  52% ] 20 VUs  0m31.0s/1m0s

running (0m32.0s), 20/20 VUs, 3151 complete and 0 interrupted iterations
steady   [  53% ] 20 VUs  0m32.0s/1m0s

running (0m33.0s), 20/20 VUs, 3254 complete and 0 interrupted iterations
steady   [  55% ] 20 VUs  0m33.0s/1m0s

running (0m34.0s), 20/20 VUs, 3349 complete and 0 interrupted iterations
steady   [  57% ] 20 VUs  0m34.0s/1m0s

running (0m35.0s), 20/20 VUs, 3443 complete and 0 interrupted iterations
steady   [  58% ] 20 VUs  0m35.0s/1m0s

running (0m36.0s), 20/20 VUs, 3545 complete and 0 interrupted iterations
steady   [  60% ] 20 VUs  0m36.0s/1m0s

running (0m37.0s), 20/20 VUs, 3644 complete and 0 interrupted iterations
steady   [  62% ] 20 VUs  0m37.0s/1m0s

running (0m38.0s), 20/20 VUs, 3742 complete and 0 interrupted iterations
steady   [  63% ] 20 VUs  0m38.0s/1m0s

running (0m39.0s), 20/20 VUs, 3836 complete and 0 interrupted iterations
steady   [  65% ] 20 VUs  0m39.0s/1m0s

running (0m40.0s), 20/20 VUs, 3949 complete and 0 interrupted iterations
steady   [  67% ] 20 VUs  0m40.0s/1m0s

running (0m41.0s), 20/20 VUs, 4055 complete and 0 interrupted iterations
steady   [  68% ] 20 VUs  0m41.0s/1m0s

running (0m42.0s), 20/20 VUs, 4149 complete and 0 interrupted iterations
steady   [  70% ] 20 VUs  0m42.0s/1m0s

running (0m43.0s), 20/20 VUs, 4260 complete and 0 interrupted iterations
steady   [  72% ] 20 VUs  0m43.0s/1m0s

running (0m44.0s), 20/20 VUs, 4354 complete and 0 interrupted iterations
steady   [  73% ] 20 VUs  0m44.0s/1m0s

running (0m45.0s), 20/20 VUs, 4450 complete and 0 interrupted iterations
steady   [  75% ] 20 VUs  0m45.0s/1m0s

running (0m46.0s), 20/20 VUs, 4555 complete and 0 interrupted iterations
steady   [  77% ] 20 VUs  0m46.0s/1m0s

running (0m47.0s), 20/20 VUs, 4648 complete and 0 interrupted iterations
steady   [  78% ] 20 VUs  0m47.0s/1m0s

running (0m48.0s), 20/20 VUs, 4732 complete and 0 interrupted iterations
steady   [  80% ] 20 VUs  0m48.0s/1m0s

running (0m49.0s), 20/20 VUs, 4827 complete and 0 interrupted iterations
steady   [  82% ] 20 VUs  0m49.0s/1m0s

running (0m50.0s), 20/20 VUs, 4935 complete and 0 interrupted iterations
steady   [  83% ] 20 VUs  0m50.0s/1m0s

running (0m51.0s), 20/20 VUs, 5031 complete and 0 interrupted iterations
steady   [  85% ] 20 VUs  0m51.0s/1m0s

running (0m52.0s), 20/20 VUs, 5129 complete and 0 interrupted iterations
steady   [  87% ] 20 VUs  0m52.0s/1m0s

running (0m53.0s), 20/20 VUs, 5233 complete and 0 interrupted iterations
steady   [  88% ] 20 VUs  0m53.0s/1m0s

running (0m54.0s), 20/20 VUs, 5324 complete and 0 interrupted iterations
steady   [  90% ] 20 VUs  0m54.0s/1m0s

running (0m55.0s), 20/20 VUs, 5432 complete and 0 interrupted iterations
steady   [  92% ] 20 VUs  0m55.0s/1m0s

running (0m56.0s), 20/20 VUs, 5525 complete and 0 interrupted iterations
steady   [  93% ] 20 VUs  0m56.0s/1m0s

running (0m57.0s), 20/20 VUs, 5616 complete and 0 interrupted iterations
steady   [  95% ] 20 VUs  0m57.0s/1m0s

running (0m58.0s), 20/20 VUs, 5720 complete and 0 interrupted iterations
steady   [  97% ] 20 VUs  0m58.0s/1m0s

running (0m59.0s), 20/20 VUs, 5834 complete and 0 interrupted iterations
steady   [  98% ] 20 VUs  0m59.0s/1m0s

running (1m00.0s), 20/20 VUs, 5919 complete and 0 interrupted iterations
steady   [ 100% ] 20 VUs  1m00.0s/1m0s

     ✓ status 200

     checks.........................: 100.00% 5939 out of 5939
     data_received..................: 1.0 MB  17 kB/s
     data_sent......................: 613 kB  10 kB/s
     http_req_blocked...............: avg=21.83µs  min=958ns    med=3.2µs    max=7.88ms   p(90)=4.54µs   p(95)=5.83µs   p(99)=18.31µs 
     http_req_connecting............: avg=12.04µs  min=0s       med=0s       max=5.91ms   p(90)=0s       p(95)=0s       p(99)=0s      
   ✓ http_req_duration..............: avg=101.3ms  min=8.38ms   med=79.93ms  max=1.15s    p(90)=212.27ms p(95)=273.59ms p(99)=545.22ms
       { expected_response:true }...: avg=101.3ms  min=8.38ms   med=79.93ms  max=1.15s    p(90)=212.27ms p(95)=273.59ms p(99)=545.22ms
   ✓ http_req_failed................: 0.00%   0 out of 5939
     http_req_receiving.............: avg=52.21µs  min=6.62µs   med=47.5µs   max=885.33µs p(90)=82.38µs  p(95)=96.45µs  p(99)=133.13µs
     http_req_sending...............: avg=11.02µs  min=2.58µs   med=9.87µs   max=829.37µs p(90)=14.37µs  p(95)=18.83µs  p(99)=39.27µs 
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     http_req_waiting...............: avg=101.24ms min=8.32ms   med=79.87ms  max=1.15s    p(90)=212.18ms p(95)=273.54ms p(99)=545.15ms
     http_reqs......................: 5939    98.611729/s
     iteration_duration.............: avg=202.35ms min=108.81ms med=180.93ms max=1.25s    p(90)=313.58ms p(95)=375.2ms  p(99)=646.43ms
     iterations.....................: 5939    98.611729/s
     vus............................: 20      min=20           max=20
     vus_max........................: 20      min=20           max=20


running (1m00.2s), 00/20 VUs, 5939 complete and 0 interrupted iterations
steady ✓ [ 100% ] 20 VUs  1m0s